In [1]:
import pandas as pd

df = pd.read_csv('국영수.csv', encoding='cp949')

In [2]:
df

   국어  영어  수학 체육
0  50  88  21  상
1  41  87  54  중
2  85  65  84  하
3  61  85  13  상
4  54  41  21  중
5  84  47  87  하
6  77  98  65  상
7  87  58  54  중
8  54  22  78  하

In [3]:
df.shape

(9, 4)

In [4]:
df.columns

Index(['국어', '영어', '수학', '체육'], dtype='object')

In [5]:
df.dtypes

국어     int64
영어     int64
수학     int64
체육    object
dtype: object

In [6]:
df.describe()

              국어         영어         수학
count   9.000000   9.000000   9.000000
mean   65.888889  65.666667  53.000000
std    17.467430  25.729361  28.583212
min    41.000000  22.000000  13.000000
25%    54.000000  47.000000  21.000000
50%    61.000000  65.000000  54.000000
75%    84.000000  87.000000  78.000000
max    87.000000  98.000000  87.000000

In [7]:
df.head()

   국어  영어  수학 체육
0  50  88  21  상
1  41  87  54  중
2  85  65  84  하
3  61  85  13  상
4  54  41  21  중

In [8]:
df.tail()

   국어  영어  수학 체육
4  54  41  21  중
5  84  47  87  하
6  77  98  65  상
7  87  58  54  중
8  54  22  78  하

In [9]:
df.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of       국어     영어     수학     체육
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False
6  False  False  False  False
7  False  False  False  False
8  False  False  False  False>

In [10]:
df['체육'].value_counts()

체육
상    3
중    3
하    3
Name: count, dtype: int64

In [11]:
df['체육'].nunique()

3

In [12]:
df['체육'].unique()

array(['상', '중', '하'], dtype=object)

In [13]:
df['국어']

0    50
1    41
2    85
3    61
4    54
5    84
6    77
7    87
8    54
Name: 국어, dtype: int64

In [14]:
df['평균'] = (df['국어']+df['영어']+df['수학'])/3

In [15]:
df

   국어  영어  수학 체육         평균
0  50  88  21  상  53.000000
1  41  87  54  중  60.666667
2  85  65  84  하  78.000000
3  61  85  13  상  53.000000
4  54  41  21  중  38.666667
5  84  47  87  하  72.666667
6  77  98  65  상  80.000000
7  87  58  54  중  66.333333
8  54  22  78  하  51.333333

In [16]:
columns = ['국어', '수학', '영어']
selected_columns = df[columns]

selected_columns

   국어  수학  영어
0  50  21  88
1  41  54  87
2  85  84  65
3  61  13  85
4  54  21  41
5  84  87  47
6  77  65  98
7  87  54  58
8  54  78  22

In [17]:
df[['국어', '영어', '수학']]

   국어  영어  수학
0  50  88  21
1  41  87  54
2  85  65  84
3  61  85  13
4  54  41  21
5  84  47  87
6  77  98  65
7  87  58  54
8  54  22  78

In [18]:
df.loc[:3,columns]

   국어  수학  영어
0  50  21  88
1  41  54  87
2  85  84  65
3  61  13  85

In [19]:
df = df.drop(['평균'], axis = 1)
df

   국어  영어  수학 체육
0  50  88  21  상
1  41  87  54  중
2  85  65  84  하
3  61  85  13  상
4  54  41  21  중
5  84  47  87  하
6  77  98  65  상
7  87  58  54  중
8  54  22  78  하

In [20]:
data = {
    'A' : [1,2,3,4],
    'B' : [4.1, 3.5, 2.1, 5.7],
    'c' : ['one', 'two', 'three', ' four']
}

df = pd.DataFrame(data)

In [21]:
df['A'].astype('category')

0    1
1    2
2    3
3    4
Name: A, dtype: category
Categories (4, int64): [1, 2, 3, 4]

In [22]:
df['A']=df['A'].astype('float')

In [23]:
df['A'].dtype

dtype('float64')

In [24]:
df = df.rename(columns= {
    'A' : 'float1',
    'B' : 'float2',
    'C' : 'category'})

In [25]:
df

   float1  float2      c
0     1.0     4.1    one
1     2.0     3.5    two
2     3.0     2.1  three
3     4.0     5.7   four

In [26]:
import numpy as np
data = {
    'Numeric1':[1, np.nan,3, 4],
    'Numeric2':[5,6,np.nan,8.2],
    'Category':['dog',np.nan,'cat','dog'] }

In [27]:
df = pd.DataFrame(data)

In [28]:
A=df.select_dtypes(include=['number']).columns
B=df.select_dtypes(include=['object', 'category']).columns

In [29]:
df[A]

   Numeric1  Numeric2
0       1.0       5.0
1       NaN       6.0
2       3.0       NaN
3       4.0       8.2

In [30]:
df[B]

  Category
0      dog
1      NaN
2      cat
3      dog

In [31]:
df.fillna(df[A].mean())

   Numeric1  Numeric2 Category
0  1.000000       5.0      dog
1  2.666667       6.0      NaN
2  3.000000       6.4      cat
3  4.000000       8.2      dog

In [32]:
df1 = pd.DataFrame({
'a':['a0','a1','a2','a3'],
'b':['b0','b1','b2','b3'],
'c':['c0','c1','c2','c3']})

df2 = pd.DataFrame({
'a':['a2','a3','a4','a5'],
'b':['b2','b3','b4','b5'],
'c':['c2','c3','c4','c5'],
'd':['d2','d3','d4','d5']})

In [33]:
pd.concat([df1, df2], axis=0)

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
0  a2  b2  c2   d2
1  a3  b3  c3   d3
2  a4  b4  c4   d4
3  a5  b5  c5   d5

In [34]:
pd.concat([df1, df2], axis=1)

    a   b   c   a   b   c   d
0  a0  b0  c0  a2  b2  c2  d2
1  a1  b1  c1  a3  b3  c3  d3
2  a2  b2  c2  a4  b4  c4  d4
3  a3  b3  c3  a5  b5  c5  d5

In [35]:
df[df['Numeric2']>=5]

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
1       NaN       6.0      NaN
3       4.0       8.2      dog

In [36]:
df['Numeric2'][df['Numeric2']>=5]

0    5.0
1    6.0
3    8.2
Name: Numeric2, dtype: float64

In [37]:
df[df['Numeric2']>=5]['Numeric2']

0    5.0
1    6.0
3    8.2
Name: Numeric2, dtype: float64

In [38]:
data = { 
'Numeric1': [1, np.nan, 3, 4], 
'Numeric2': [5, 6, np.nan, 8.2], 
'Category': ['dog', np.nan, 'cat', 'dgo'] 
} 
df = pd.DataFrame(data)
filter_df = df[df['Category'] == 'dog']
filter_df_contains = df[df['Category'].str.contains('d', na=False) & df['Category'].str.contains('o', na=False)]

In [39]:
filter_df

   Numeric1  Numeric2 Category
0       1.0       5.0      dog

In [40]:
filter_df_contains

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
3       4.0       8.2      dgo

In [75]:
# 여기부터 중간 이후



df = pd.DataFrame({'variable': ['value1-value2-value3', 'value4-value5', 'value6']})

In [70]:
split_df = df['variable'].str.split('-', expand=True)

In [71]:
split_df.columns = ['var1', 'var2', 'var3']

In [72]:
split_df

     var1    var2    var3
0  value1  value2  value3
1  value4  value5    None
2  value6    None    None

In [73]:
df['variable'] = df['variable'].str[0:5]

In [74]:
df

  variable
0    value
1    value
2    value

In [76]:
df['variable'] = df['variable'].str[0:5] + df['variable'].str[6:12]

In [77]:
df

      variable
0  value-value
1  value-value
2        value

In [82]:
split_df['var1'] = split_df['var1'].astype(str)
split_df['var2'] = split_df['var2'].astype(str)
split_df['var3'] = split_df['var3'].astype(str)

split_df['combined'] = split_df['var1'] + '-' + split_df['var2'] + '-' + split_df['var3']

In [84]:
split_df

     var1    var2    var3              combined
0  value1  value2  value3  value1-value2-value3
1  value4  value5    None    value4-value5-None
2  value6    None    None      value6-None-None

In [2]:
# 중요
df = pd.DataFrame({'variable': ['value1-value2-value3', 'value3-value1-value5', 'vvdfvalue1656']})

df['new_variable'] = df['variable'].str.replace(r'value1.*', 'value1', regex=True)
# 특정문자가 포함되어있으면 그 부분부터 끝까지를 해당 문자로 변경한다.

In [3]:
df

               variable   new_variable
0  value1-value2-value3         value1
1  value3-value1-value5  value3-value1
2         vvdfvalue1656     vvdfvalue1

In [4]:
df['new_variable1'] = df['variable'].str.extract(r'(value1)')
# 특정 문자가 포함되어있으면 전체를 해당 문자로 변경한다.

In [5]:
df

               variable   new_variable new_variable1
0  value1-value2-value3         value1        value1
1  value3-value1-value5  value3-value1        value1
2         vvdfvalue1656     vvdfvalue1        value1

In [7]:
conti = df[df['variable'].str.contains('value2', na=False)]

conti['variable'].str.extract(r'(value2)')

        0
0  value2

In [107]:
df

               variable   new_variable new_variable1
0  value1-value2-value3         value1        value1
1  value3-value1-value5  value3-value1        value1
2         vvdfvalue1656     vvdfvalue1        value1

In [8]:
data = {'date': ['202103151345', '20210315 1345', '0715', '07-15', '20210315','1']} 
df = pd.DataFrame(data)
df

            date
0   202103151345
1  20210315 1345
2           0715
3          07-15
4       20210315
5              1

In [56]:
df['date']=pd.to_datetime(df['date'], format='%Y%m%d %H%M' , errors='coerce')
# raise -> 변환에 실패하면 오류
# coerce -> 변환에 실패하면 NaT로 변환
# ignore -> 변환에 실패하면 원본 데이터 반환

df

                 date
0                 NaT
1 2021-03-15 13:45:00
2                 NaT
3                 NaT
4                 NaT
5                 NaT

In [10]:
df['date']=pd.to_datetime(df['date'], format='%H%M' , errors='coerce').dt.time
df

       date
0       NaT
1       NaT
2  07:15:00
3       NaT
4       NaT
5       NaT

In [62]:
df['date']=pd.to_datetime(df['date'], format='%Y%m%d %H%M' , errors='ignore')
df

            date
0   202103151345
1  20210315 1345
2           0715
3          07-15
4       20210315
5              1

In [95]:
data = {'hour':['1', '2', '12', '22', '11']}
df = pd.DataFrame(data)
df

  hour
0    1
1    2
2   12
3   22
4   11

In [85]:
pd.to_datetime(df['hour'], format='%H%M', errors='coerce').dt.time

0         NaT
1         NaT
2    01:02:00
3    02:02:00
4    01:01:00
Name: hour, dtype: object

In [94]:
df['hour']=df['hour'].str.rjust(4, fillchar='0')
#4자리 중 오른쪽에 글자가 들어가고 남은 자리는 0으로 채운다
pd.to_datetime(df['hour'], format='%H%M', errors='coerce').dt.time

0    00:01:00
1    00:02:00
2    00:12:00
3    00:22:00
4    00:11:00
Name: hour, dtype: object

In [96]:
df['hour']=df['hour'].str.ljust(4, fillchar='0')
#4자리 중 왼쪽에 글자가 들어가고 남은 자리는 0으로 채운다
pd.to_datetime(df['hour'], format='%H%M', errors='coerce').dt.time

0    10:00:00
1    20:00:00
2    12:00:00
3    22:00:00
4    11:00:00
Name: hour, dtype: object

In [97]:
df.to_csv('new_program.csv', index=False)
#df.to_csv('new_program.csv', index=False, encoding='cp949')
# 데이터프레임을 csv로 저장, index 표시하지 않고 cp949 인코딩

In [35]:
df = pd.read_csv('program.csv', encoding='utf-8')

In [36]:
df

  코드  프로그램1  프로그램2  프로그램3  프로그램4        생년월일  출생시간
0  A     57     24     85     47  1995/12/25   105
1  B     56     98     65      0  1997/05/21  1205
2  C     62     89     56     66  1997/04/07   172
3  D     54     87     94     54  1995/02/04  1101
4  E     54     54     47     84  1994/07/03   122
5  F     23     51     71     68  1996/05/21  1425

In [37]:
df['출생시간'] = df['출생시간'].astype(str)
df['출생시간'] = df['출생시간'].str.ljust(4, fillchar='0')

df['출생시간'] = pd.to_datetime(df['출생시간'], format='%H%M', errors='coerce').dt.time

In [38]:
df

  코드  프로그램1  프로그램2  프로그램3  프로그램4        생년월일      출생시간
0  A     57     24     85     47  1995/12/25  10:50:00
1  B     56     98     65      0  1997/05/21  12:05:00
2  C     62     89     56     66  1997/04/07  17:20:00
3  D     54     87     94     54  1995/02/04  11:01:00
4  E     54     54     47     84  1994/07/03  12:20:00
5  F     23     51     71     68  1996/05/21  14:25:00

In [39]:
df['프로그램1'] = df['프로그램1'].astype(str)
df['프로그램2'] = df['프로그램2'].astype(str)
df['프로그램3'] = df['프로그램3'].astype(str)
df['프로그램4'] = df['프로그램4'].astype(str)

df['프로그램'] = df['프로그램1'] + '-' + df['프로그램2'] + '-' + df['프로그램3'] + '-' + df['프로그램4']

In [40]:
df = df.drop(['프로그램1','프로그램2','프로그램3','프로그램4'], axis=1)

In [41]:
df

  코드        생년월일      출생시간         프로그램
0  A  1995/12/25  10:50:00  57-24-85-47
1  B  1997/05/21  12:05:00   56-98-65-0
2  C  1997/04/07  17:20:00  62-89-56-66
3  D  1995/02/04  11:01:00  54-87-94-54
4  E  1994/07/03  12:20:00  54-54-47-84
5  F  1996/05/21  14:25:00  23-51-71-68

In [26]:
import pandas as pd
import numpy as np

data = {
    'Numeric1' : [1, np.nan, 3, 4],
    'Numeric2' : [5, 6, np.nan, 8.2],
    'Category' : ['dog', np.nan, 'cat', 'dog']
}

df = pd.DataFrame(data)

In [27]:
df['Numeric2'][df['Numeric2']>5]

1    6.0
3    8.2
Name: Numeric2, dtype: float64

In [28]:
df

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
1       NaN       6.0      NaN
2       3.0       NaN      cat
3       4.0       8.2      dog

In [12]:
filter_df = df[df['Category']=='dog']
filter_df

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
3       4.0       8.2      dog

In [13]:
filter_df_contains = df[df['Category'].str.contains('do', na=False)]
filter_df_contains

   Numeric1  Numeric2 Category
0       1.0       5.0      dog
3       4.0       8.2      dog